`timescale 1ns / 1ps

/* 《天空之城》 */
module song3(clk_5MHz,clk_4Hz,select,beep);
	
input clk_5MHz,clk_4Hz,select;			
output beep;					  

reg  [3:0]high,med,low;
reg  [15:0]origin;
reg	beep_r;					  
reg  [7:0]state;					
reg  [15:0]count;			

assign beep = beep_r;	     

/* 扬声器基本驱动 */
always @(posedge clk_5MHz)
begin
	/* 计数器 */
	count <= count + 1'b1;		
	if(count == origin)
	begin
		/* 计数器清零 */
		count <= 16'h0;			
		/* 输出取反 */
		beep_r <= !beep_r;		
	end
end

/* 音调输出转换 */
always@(posedge clk_4Hz)
begin
	if(select)
	begin
		case({high,med,low})
			'b000000000001:origin=22900; //低1
			'b000000000010:origin=20408; //低2
			'b000000000011:origin=18181; //低3
			'b000000000100:origin=17142; //低4
			'b000000000101:origin=15267; //低5
			'b000000000110:origin=13605; //低6
			'b000000000111:origin=12121; //低7
			'b000000010000:origin=11472; //中1
			'b000000100000:origin=10216; //中2
			'b000000110000:origin=9101;  //中3
			'b000000111000:origin=8571;  //中4
			'b000001010000:origin=7653;  //中5
			'b000001100000:origin=6818;  //中6
			'b000010000000:origin=6060;  //中7
			'b000100000000:origin=5733;  //高1
			'b001000000000:origin=5108;  //高2
			'b001100000000:origin=4551;  //高3
			'b001010000000:origin=4294;  //高4
			'b010000000000:origin=3826;  //高5
			'b011000000000:origin=3409;  //高6
			'b010100000000:origin=3050;  //高7
		endcase
	end
	
	else
		origin=0000;
		
end

/* 《天空之城》乐谱翻译 */
always @(posedge clk_4Hz)	
begin

if(select)
begin

	/* 全曲总节拍数 */
	if(state ==193)
		/* 自动重放 */
		state = 0;
	else
		/* 节拍计数 */
		state = state + 1'b1; 
	
	case(state)
		/* 按小节间隔 */
		/* 1 */
		0:											{high,med,low}='b000001100000;//中6
		1:					    					{high,med,low}='b000010000000;//中7
					
		/* 2 */
		2,3,4:									{high,med,low}='b000100000000;//高1
		5:											{high,med,low}='b000010000000;//中7
		6,7:                					{high,med,low}='b000100000000;//高1
		8,9:										{high,med,low}='b001100000000;//高3
					
		/* 3 */
		10,11,12,13,14,15:					{high,med,low}='b000010000000;//中7
		16,17:            					{high,med,low}='b000000110000;//中3
		
		/* 4 */		
		18,19,20:								{high,med,low}='b000001100000;//中6
		21:		 								{high,med,low}='b000001010000;//中5
		22,23:              	 				{high,med,low}='b000001100000;//中6
		24,25:									{high,med,low}='b000100000000;//高1
		
		/* 5 */
		26,27,28,29,30,31:					{high,med,low}='b000001010000;//中5   							
		32:				       				{high,med,low}='b000000100000;//中2
		33:			          				{high,med,low}='b000000110000;//中3
		
		/* 6 */
		34,35,36:				 				{high,med,low}='b000000111000;//中4
		37:					    				{high,med,low}='b000000110000;//中3
		38,39:					   			{high,med,low}='b000000111000;//中4
		40,41:				 					{high,med,low}='b000100000000;//高1
		
		/* 7 */
		42,43,44,45,46,47:      			{high,med,low}='b000000110000;//中3
		48,49:			    					{high,med,low}='b000100000000;//高1
		
		/* 8 */
		50,51,52:		       				{high,med,low}='b000010000000;//中7
		53,54,55:             				{high,med,low}='b000000111000;//中4
		56,57:									{high,med,low}='b000010000000;//中7
		
		/* 9 */
		58,59,60,61,62,63:					{high,med,low}='b000010000000;//中7
		64:					    				{high,med,low}='b000001100000;//中6
		65:				       				{high,med,low}='b000010000000;//中7
		
		/* 10 */
		66,67,68:	          				{high,med,low}='b000100000000;//高1
		69:					    				{high,med,low}='b000010000000;//中7
		70,71:			       				{high,med,low}='b000100000000;//高1
		72,73:			       				{high,med,low}='b001100000000;//高3
		
		/* 11 */
		74,75,76,77,78,79:					{high,med,low}='b000010000000;//中7
		80,81:			       				{high,med,low}='b000000110000;//中3
		
		/* 12 */
		82,83,84:    			 				{high,med,low}='b000001100000;//中6
		85:					    				{high,med,low}='b000000000101;//中5
		86,87:			       				{high,med,low}='b000001100000;//中6			
		88,89:                				{high,med,low}='b000100000000;//高1
		
		/* 13 */
		90,91,92,93,94,95:	 				{high,med,low}='b000001010000;//中5   							
		96:				       				{high,med,low}='b000000100000;//中2
		97:			          				{high,med,low}='b000000110000;//中3
		
		/* 14 */
		98,99:			 		 				{high,med,low}='b000000111000;//中4 
		100:					    				{high,med,low}='b000100000000;//高1
		101,102,103:							{high,med,low}='b000010000000;//中7
		104,105:					 				{high,med,low}='b000100000000;//高1
		
		/* 15 */
		106,107:					 				{high,med,low}='b001000000000;//高2
		108:						 				{high,med,low}='b001100000000;//高3
		109,110,111,112,113:					{high,med,low}='b000100000000;//高1
		
		/* 16 */
		114:										{high,med,low}='b000100000000;//高1
		115:		         			    	{high,med,low}='b000010000000;//中7			
		116:								 		{high,med,low}='b000001100000;//中6
		117:								 		{high,med,low}='b000001010000;//中5		
		118,119:								 	{high,med,low}='b000010000000;//中7
		120,121:								 	{high,med,low}='b000001010000;//中5
		
		/* 17 */
		122,123,124,125,126,127:			{high,med,low}='b000001100000;//中6
		128:					 					{high,med,low}='b000100000000;//高1
		129:						 				{high,med,low}='b001000000000;//高2
		
		/* 18 */
		130,131,132:    						{high,med,low}='b001100000000;//高3
		133:										{high,med,low}='b001000000000;//高2
		134,135:									{high,med,low}='b001100000000;//高3			
		136,137:            					{high,med,low}='b010000000000;//高5
		
		/* 19 */
		138,139,140,141,142,143:			{high,med,low}='b001000000000;//高2
		144,145:									{high,med,low}='b000001010000;//中5
		
		/* 20 */
		146,147,148:    						{high,med,low}='b000100000000;//高1
		149:										{high,med,low}='b000010000000;//中7
		150,151:									{high,med,low}='b000100000000;//高1
		152,153:									{high,med,low}='b001100000000;//高3
		
		/* 21 */
		154,155,156,157,158,159,160,161:	{high,med,low}='b000010000000;//中7
		
		/* 22 */
		162:										{high,med,low}='b000001100000;//中6
		163:										{high,med,low}='b000010000000;//中7
		164,165:									{high,med,low}='b000100000000;//高1
		166:										{high,med,low}='b000010000000;//中7
		167:										{high,med,low}='b000100000000;//高1
		168,169:									{high,med,low}='b001000000000;//高2
		
		/* 23 */
		170,171,172:							{high,med,low}='b000100000000;//高1	
		173,174,175,176,177:					{high,med,low}='b000001010000;//中5
		
		/* 24 */
		178,179:									{high,med,low}='b001010000000;//高4
		180,181:									{high,med,low}='b001100000000;//高3								
		182,183:									{high,med,low}='b001000000000;//高2
		184,185:									{high,med,low}='b000100000000;//高1
		
		/* 25 */
		186,187,188,189,190,191,192,193:	{high,med,low}='b001100000000;//高3	
	
	endcase

end

end

endmodule









